'use strict';

// 每处调用 this.ctx.throw(code) 都必须有唯一的 code
// code 不能小于 1000
module.exports = {
  99999: '抛出错误，未指定code',

  /**
   * 10000 ~ 19999
   * controller层数据验证出错
   */
  10001: '密码不一致',
  10002: '数据格式不正确',

  /**
   * 20000 ~ 29999
   * service层出错
   */
  20001: '用户已存在',
  20002: '输入数据格式有误',
  20003: '数据入库失败',
  20004: '用户密码加密失败',

  20101: '图片已存在',
  20102: '输入数据格式有误',
  20103: '数据入库失败',
  20104: '图片已存在',
  20105: '输入数据格式有误',
  20106: '更新数据失败',

  20201: '博文已存在',
  20202: '输入数据格式有误',
  20203: '数据入库失败',
  20204: '图片已存在',
  20205: '输入数据格式有误',
  20206: '更新数据失败',

  20301: '已存在',
  20302: '输入数据格式有误',
  20303: '数据入库失败',

  20401: '已存在',
  20402: '输入数据格式有误',
  20403: '数据入库失败',
  20404: '已存在',
  20405: '输入数据格式有误',
  20406: '更新数据失败',
};
